{
  "I18N.LANGUAGE": "Français",
  "more-dynamic-token-rings": {
    "module-settings": {
      "button": "Configurer les anneaux avec SETT",
      "custom-ring": {
        "menu": {
          "settings-button": "Créateur d'anneaux personnalisés",
          "header": "Créer une feuille de sprites et un JSON d'anneau de jeton",
          "icons": {
            "kofi": {
              "title": "Soutenez-moi sur Ko-fi",
              "tooltip": "Faites un don pour vous en débarrasser !"
            }
          },
          "content": {
            "link-to-guide": "Lien vers le guide ici"
          },
          "parts": {
            "spritesheet": "Configuration de la feuille de sprites de l'anneau",
            "json": "Configuration JSON de l'anneau"
          },
          "fields": {
            "token-img": {
              "ring": {
                "label": "Anneau de jeton dynamique",
                "tooltip": "Doit être de 2048px x 2048px"
              },
              "background": {
                "label": "Fond de jeton dynamique",
                "tooltip": "Doit être de 2048px x 2048px"
              },
              "quality": {
                "label": "Qualité de l'anneau",
                "tooltip": "Qualité du Webp généré, recommandé 80%"
              }
            },
            "thickness": {
              "label": "Épaisseur de l'anneau",
              "tooltip": "Quelle est l'épaisseur de l'anneau de l'intérieur à l'extérieur comme une valeur de 0 à 1, 1 étant 100%"
            },
            "coloration": {
              "label": "Coloration de l'anneau",
              "inner": {
                "label": "Bord intérieur",
                "tooltip": "Où sur l'anneau la coloration doit-elle commencer comme une valeur de 0 à 1, 1 étant 100% de distance du centre"
              },
              "outer": {
                "label": "Bord extérieur",
                "tooltip": "Où sur l'anneau la coloration doit-elle se terminer comme une valeur de 0 à 1.5, 1 étant 100% de distance du centre"
              },
              "color": {
                "label": "Couleur",
                "tooltip": "Entrez la valeur Hex de la couleur qui est le 'blanc' lorsque l'anneau est recoloré (c'est-à-dire si vous choisissez une couleur bleue, le bleu sera le plus recoloré)"
              }
            }
          },
          "error": {
            "upload-both": "Veuillez télécharger les deux images pour créer un anneau",
            "2048-min": "Les deux images doivent être de 2048px x 2048px.",
            "failed-to-download": {
              "json": "Échec du téléchargement du JSON :",
              "image": "Échec du téléchargement ou de la conversion de l'image :"
            },
            "does-not-exist": "SETT : L'anneau personnalisé n'existe pas, veuillez en créer un réellement"
          },
          "buttons": {
            "create": {
              "label": "Créer"
            },
            "export": {
              "label": "Exporter"
            },
            "cancel": {
              "label": "Annuler"
            }
          }
        },
        "enabled": {
          "name": "Anneau personnalisé activé",
          "hint": "Active l'anneau personnalisé dans le sélecteur d'anneaux dynamiques, notez que vous devez recharger chaque fois que vous changez une propriété pour qu'elle soit mise à jour"
        },
        "kofi-code": {
          "name": "Code de Kofi",
          "hint": "Si vous faites un don de n'importe quel montant à mon kofi, vous pouvez supprimer l'icône d'en-tête et les messages du Créateur d'anneaux personnalisés"
        }
      }
    },
    "notifications": {
      "ring-list-saved": "Votre liste d'anneaux dynamiques a été mise à jour, rechargez pour voir les nouveaux anneaux",
      "first-time-user": {
        "content": "<h2>Bienvenue dans SETT</h2><p>Bonjour, bienvenue dans le module.</p><p>Pour accéder aux nouveaux anneaux de jeton, cliquez sur Configurer les paramètres et naviguez vers les paramètres du module SETT. Activez certains des anneaux là-bas, sauvegardez les changements, et on vous demandera de recharger Foundry. Après l'avoir fait, ouvrez à nouveau les paramètres et trouvez le paramètre déroulant Core -> Anneau de jeton dynamique, qui inclura maintenant les anneaux supplémentaires. Sélectionnez-en un, sauvegardez les changements, et rechargez Foundry une fois de plus.</p>",
        "button": "Faire une visite"
      },
      "reload-to-switch": "Après avoir ajouté le nouvel anneau dynamique, redémarrez à nouveau pour l'activer réellement !"
    },
    "dialog": {
      "reload": {
        "title": "Recharger ?",
        "content": "Voulez-vous recharger ?",
        "buttons": {
          "yes": "Oui",
          "no": "Non"
        }
      },
      "ring-submission": {
        "title": "Soumission d'anneau",
        "content": "Voulez-vous soumettre cet anneau (qui est sans droits d'auteur ou dont vous avez les droits légaux) au module ?"
      }
    },
    "hover-text": {
      "new-ring": "Nouvel anneau !",
      "click-ring": "En cliquant, vous serez invité à recharger pour activer rapidement l'anneau. [IMPORTANT] cela NE sauvegardera PAS les autres modifications apportées dans le menu, alors soumettez-les d'abord !"
    },
    "tours": {
      "starter": {
        "title": "Visite de démarrage SETT",
        "steps": {
          "1": {
            "title": "Naviguer vers",
            "content": "Après avoir ouvert les paramètres, naviguez d'abord vers les paramètres 'Core'"
          },
          "2": {
            "title": "Menu SETT",
            "content": "Vous devriez voir le bouton SETT qui a été inséré, utilisez-le pour activer de nouveaux anneaux !"
          },
          "3": {
            "title": "Après cela",
            "content": "Après avoir activé les anneaux, assurez-vous de cliquer sur sauvegarder, puis on vous demandera de recharger Foundry"
          },
          "4": {
            "title": "Sélectionner un anneau",
            "content": "Sélectionnez un anneau ici, il vous demandera de recharger pour qu'il puisse mettre à jour les anneaux"
          },
          "5": {
            "title": "Merci",
            "content": "Merci d'avoir fait la visite, n'oubliez pas de donner un pourboire à votre guide touristique (moi) et à vos serveurs (Créateurs d'anneaux) en partant si vous vous sentez enclin à le faire :P."
          }
        }
      },
      "custom": {
        "notification": {
          "title": "✨Anneaux personnalisés✨",
          "step": "Il y a une nouvelle fonctionnalité ! Pour y accéder, vous devrez vous rendre dans les paramètres du module SETT et cliquer sur le nouveau bouton en haut de ces paramètres pour utiliser le nouveau système de création d'anneaux personnalisés. Bonne chance et profitez des nouvelles options !"
        },
        "full": {
          "1": {
            "title": "Guide des anneaux personnalisés",
            "content": "Voici un guide général pour utiliser cette fonctionnalité. Je vous recommande de le parcourir rapidement d'abord pour éviter toute confusion. Cette visite ne vous montrera que les bases"
          },
          "2": {
            "title": "Images de la feuille de sprites de l'anneau",
            "content": "Ici, vous pouvez télécharger l'anneau dynamique et l'arrière-plan pour créer la 'Feuille de sprites de l'anneau dynamique'. Notez que vous devez ajouter les deux à la fois pour enregistrer correctement la feuille de sprites. Si vous souhaitez uniquement modifier la configuration pour un anneau personnalisé que vous avez déjà créé, ignorez simplement ces éléments."
          },
          "3": {
            "title": "Configuration de l'anneau",
            "content": "Voici les paramètres de configuration pour l'anneau personnalisé, survolez-les pour voir une description de chacun ainsi qu'une aide visuelle"
          },
          "4": {
            "title": "Créer un anneau",
            "content": "Ce bouton enregistrera votre anneau et votre arrière-plan téléchargés dans une feuille de sprites si vous les avez, ainsi que vos données de configuration dans le json de l'anneau. Après avoir créé l'anneau, vous devrez recharger pour activer votre nouvel anneau personnalisé."
          },
          "5": {
            "title": "Exporter l'anneau",
            "content": "Ce bouton vous permet d'exporter la feuille de sprites de l'anneau et son json correspondant. Vous pouvez ensuite soumettre ces fichiers sur github pour qu'ils soient éventuellement ajoutés au module !"
          },
          "6": {
            "title": "Bon voyage ! ✈",
            "content": "Bonne chance et bon travail de création d'anneaux !<hr><i>envisagez également de me soutenir sur <a href='https://ko-fi.com/chasarooni'>kofi</a> pour que je puisse me motiver à faire plus de choses cool comme ça</i>"
          }
        }
      }
    }
  }
}
