{
  "I18N.LANGUAGE": "Polski",
  "more-dynamic-token-rings": {
    "module-settings": {
      "button": "Konfiguracja pierścieni za pomocą SETT",
      "custom-ring": {
        "menu": {
          "settings-button": "Niestandardowy kreator pierścieni",
          "header": "Tworzenie obrazu pierścienia Tokenu i JSON",
          "icons": {
            "kofi": {
              "title": "Wesprzyj mnie na Ko-fi",
              "tooltip": "Przekaż mi darowiznę, aby się tego pozbyć!"
            }
          },
          "content": {
            "link-to-guide": "Link do przewodnika tutaj"
          },
          "parts": {
            "spritesheet": "Konfiguracja obrazu pierścienia",
            "json": "Konfiguracja pierścienia JSON"
          },
          "fields": {
            "token-img": {
              "ring": {
                "label": "Dynamiczny pierścień tokena",
                "tooltip": "Musi mieć rozmiar 2048px x 2048px"
              },
              "background": {
                "label": "Dynamiczne tło tokena",
                "tooltip": "Musi mieć rozmiar 2048px x 2048px"
              },
              "quality": {
                "label": "Jakość pierścienia",
                "tooltip": "Jakość wygenerowanego Webp, zalecane 80%"
              }
            },
            "thickness": {
              "label": "Grubość pierścienia",
              "tooltip": "Grubość pierścienia od wewnątrz do zewnątrz pierścienia jako wartość od 0 do 1, gdzie 1 oznacza 100%."
            },
            "coloration": {
              "label": "Zabarwienie pierścienia",
              "inner": {
                "label": "Wewnętrzna krawędź",
                "tooltip": "Gdzie na pierścieniu powinna zaczynać się kolorystyka jako wartość od 0 do 1, gdzie 1 to 100% odległości od środka."
              },
              "outer": {
                "label": "Zewnętrzna krawędź",
                "tooltip": "Gdzie na pierścieniu powinno kończyć się zabarwienie jako wartość od 0 do 1,5, gdzie 1 oznacza 100% odległości od środka."
              },
              "color": {
                "label": "Kolor",
                "tooltip": "Wprowadź wartość Hex koloru, który jest „biały”, gdy pierścień jest odbarwiany (np., jeśli zrobisz niebieski kolor, niebieski zostanie maksymalnie odbarwiony)."
              }
            }
          },
          "error": {
            "upload-both": "Prześlij oba obrazy, aby utworzyć pierścień",
            "2048-min": "Oba obrazy muszą mieć rozmiar 2048px x 2048px.",
            "failed-to-download": {
              "json": "Nie udało się pobrać pliku JSON:",
              "image": "Nie udało się pobrać lub przekonwertować obrazu:"
            },
            "does-not-exist": "SETT: Pierścień niestandardowy nie istnieje, należy go utworzyć"
          },
          "buttons": {
            "create": {
              "label": "Utwórz"
            },
            "export": {
              "label": "Eksportuj"
            },
            "cancel": {
              "label": "Anuluj"
            }
          }
        },
        "enabled": {
          "name": "Włączony pierścień niestandardowy",
          "hint": "Włącza niestandardowy pierścień do dynamicznego selektora pierścieni, pamiętaj, że musisz przeładować za każdym razem, gdy zmieniasz właściwość, aby ją zaktualizować."
        },
        "kofi-code": {
          "name": "Kod od Kofi",
          "hint": "Jeśli kiedykolwiek przekażesz jakąkolwiek kwotę na rzecz my kofi, możesz usunąć ikonę nagłówka i wiadomości z Kreatora pierścieni niestandardowych"
        }
      }
    },
    "notifications": {
      "ring-list-saved": "Dynamiczna lista pierścieni została zaktualizowana, załaduj ponownie, aby zobaczyć nowe pierścienie",
      "first-time-user": {
        "content": "<h2>Witamy w SETT</h2><p>Cześć, witam w module.</p><p>Aby uzyskać dostęp do nowych pierścieni tokenów, kliknij Skonfiguruj Ustawienia i przejdź do ustawień modułu SETT. Włącz tam niektóre pierścienie, zapisz zmiany, a zostaniesz poproszony o ponowne załadowanie Foundry. Po wykonaniu tej czynności ponownie otwórz ustawienia i znajdź rozwijane ustawienie Bazowa -> Dynamiczne Pierścienie Tokena, które będzie teraz zawierać dodatkowe pierścienie. Wybierz jeden z nich, zapisz zmiany i ponownie załaduj Foundry.</p>",
        "button": "Zapraszamy na przewodnik"
      },
      "reload-to-switch": "Po dodaniu nowego pierścienia dynamicznego należy ponownie uruchomić grę, aby go aktywować!"
    },
    "dialog": {
      "reload": {
        "title": "Przeładować?",
        "content": "Czy chcesz przeładować?",
        "buttons": {
          "yes": "Tak",
          "no": "Nie"
        }
      },
      "ring-submission": {
        "title": "Przesłanie pierścienia",
        "content": "Czy chcesz przesłać ten pierścień (który jest wolny od praw autorskich lub masz do niego prawa) do modułu?"
      }
    },
    "hover-text": {
      "new-ring": "Nowy pierścień!",
      "click-ring": "Po kliknięciu zostaniesz poproszony o przeładowanie, aby szybko aktywować pierścień.",
      "click-ring-warning": "[WAŻNE] NIE spowoduje to zapisania żadnych innych zmian wprowadzonych w ustawieniach, więc prześlij je najpierw!"
    },
    "tours": {
      "starter": {
        "title": "Przewodnik dla początkujących SETT",
        "steps": {
          "1": {
            "title": "Nawiguj do",
            "content": "Po otwarciu ustawień najpierw przejdź do ustawień \"Bazowe\""
          },
          "2": {
            "title": "Menu SETT",
            "content": "Powinieneś zobaczyć przycisk SETT, który został dodany, użyj go, aby włączyć nowe pierścienie!"
          },
          "3": {
            "title": "Następnie",
            "content": "Po włączeniu pierścieni upewnij się, że kliknąłeś przycisk Zapisz, a następnie zostaniesz poproszony o ponowne załadowanie Foundry"
          },
          "4": {
            "title": "Wybieranie pierścienia",
            "content": "Po wybraniu pierścienia zostanie wyświetlony monit o ponowne załadowanie, aby można było zaktualizować pierścienie"
          },
          "5": {
            "title": "Dzięki",
            "content": "Dzięki za przewodnik, pamiętaj, aby dać napiwek swojemu przewodnikowi (mnie) i serwerom (Ring Makers) przy wyjściu, jeśli masz na to ochotę :P."
          }
        }
      },
      "custom": {
        "notification": {
          "title": "✨Niestandardowe pierścienie✨",
          "step": "Pojawiła się nowa funkcja! Aby uzyskać do niej dostęp, musisz przejść do ustawień modułu SETT i kliknąć nowy przycisk u góry tych ustawień, aby użyć nowego systemu tworzenia niestandardowych pierścieni. Powodzenia i ciesz się nowymi opcjami!"
        },
        "full": {
          "1": {
            "title": "Przewodnik po niestandardowych pierścieniach",
            "content": "Tutaj zamieściłem ogólny przewodnik dotyczący korzystania z tej funkcji. Zalecam przynajmniej przejrzenie go najpierw, aby uniknąć nieporozumień. Ta instrukcja obejmie tylko podstawy"
          },
          "2": {
            "title": "Obrazy pierścienia",
            "content": "Tutaj możesz przesłać dynamiczny pierścień i tło, aby utworzyć „arkusz sprite'ów dynamicznego pierścienia”. Pamiętaj, że musisz dodać oba naraz, aby poprawnie zapisać arkusz sprite'ów. Jeśli chcesz tylko edytować konfigurację niestandardowego pierścienia, który już utworzyłeś, po prostu zignoruj te czynności."
          },
          "3": {
            "title": "Konfiguracja pierścienia",
            "content": "Oto ustawienia konfiguracji niestandardowego pierścienia, najedź na nie kursorem, aby zobaczyć opis każdego z nich, a także pomoc wizualną"
          },
          "4": {
            "title": "Utwórz pierścień",
            "content": "Ten przycisk zapisze przesłany pierścień i tło w arkuszu sprite'ów, jeśli je masz, a także zapisze dane konfiguracyjne w pliku json pierścienia. Po utworzeniu pierścienia będziesz musiał przeładować, aby włączyć nowy niestandardowy pierścień."
          },
          "5": {
            "title": "Eksportuj pierścień",
            "content": "Ten przycisk pozwala wyeksportować arkusz sprite'ów pierścienia i odpowiadający mu json. Następnie możesz przesłać te pliki na github, aby ewentualnie dodać je do modułu!"
          },
          "6": {
            "title": "Wyślij! ✈",
            "content": "Powodzenia i szczęśliwego tworzenia pierścieni!<hr><i>rozważ również przekazanie mi darowizny na <a href='https://ko-fi.com/chasarooni'>kofi</a> abym mógł zmotywować się do robienia więcej takich fajnych rzeczy.</i>"
          }
        }
      }
    }
  }
}
